# Pandas and numpy - pair-up
### Discussion session

1. How will you read the following data into a pandas data frame ? 
 ` ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt`

In [39]:
import numpy as np
import pandas as pd

In [29]:
url = 'ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt'

In [30]:
cols = ['Year','Month','Date', 'average','interpolated','trend','days']

In [31]:
df=pd.read_csv(url,comment='#', delim_whitespace=True, names = cols)

In [32]:
df.head(5)

   Year  Month      Date  average  interpolated   trend  days
0  1958      3  1958.208   315.71        315.71  314.62    -1
1  1958      4  1958.292   317.45        317.45  315.29    -1
2  1958      5  1958.375   317.50        317.50  314.71    -1
3  1958      6  1958.458   -99.99        317.10  314.85    -1
4  1958      7  1958.542   315.86        315.86  314.98    -1

2. How would you pick columns 0,1,3 ?  
`[[0, 1, 3]]`

In [36]:
cols_sub =[df.columns[n] for n in(0,1,3)]
cols_sub

['Year', 'Month', 'average']

In [38]:
df[cols_sub].head()

   Year  Month  average
0  1958      3   315.71
1  1958      4   317.45
2  1958      5   317.50
3  1958      6   -99.99
4  1958      7   315.86

3. Use a for loop to find all rows where 
Co2 (column 3) enteries with the value -99.99 (these are missing values) and replace them with NaN values (try using np.nan - do you know what it is? )

In [42]:
mask = df['average'] == -99.99
df.loc[mask,'average']

3     -99.99
7     -99.99
71    -99.99
72    -99.99
73    -99.99
213   -99.99
313   -99.99
Name: average, dtype: float64

In [43]:
df['average'].replace(to_replace = -99.99, value = np.nan, inplace=True)

In [44]:
df.loc[mask,'average'] #check

3     NaN
7     NaN
71    NaN
72    NaN
73    NaN
213   NaN
313   NaN
Name: average, dtype: float64

4. Change names of columns to year, month, and CO2 (use colnames)

strip spaces of col names
```python
df.columns = df.columns.str.strip()
```

In [45]:
df.columns = ['Year','Month','Date', 'C02_average','interpolated','trend','days']

In [46]:
df.head()

   Year  Month      Date  C02_average  interpolated   trend  days
0  1958      3  1958.208       315.71        315.71  314.62    -1
1  1958      4  1958.292       317.45        317.45  315.29    -1
2  1958      5  1958.375       317.50        317.50  314.71    -1
3  1958      6  1958.458          NaN        317.10  314.85    -1
4  1958      7  1958.542       315.86        315.86  314.98    -1

5. Add a column 'Day' and specifiy the day 15 for all enteries

In [47]:
df.insert(len(df.columns),'Day',15)

In [48]:
df.head()

   Year  Month      Date  C02_average  interpolated   trend  days  Day
0  1958      3  1958.208       315.71        315.71  314.62    -1   15
1  1958      4  1958.292       317.45        317.45  315.29    -1   15
2  1958      5  1958.375       317.50        317.50  314.71    -1   15
3  1958      6  1958.458          NaN        317.10  314.85    -1   15
4  1958      7  1958.542       315.86        315.86  314.98    -1   15





6. Add a date column according to the 'year', 'month' and 'day' columns (options: use apply with lambda or for loop together with datetime.date (make sure to import it)) 

7. Drop the 'Day' column

8. use pandas groupby to print the yeaerly avg. of co2 per year. 

9. Pick columns that you think could be used to build a model and store them in numpy array (Answer why do we do that?)

10. repeat step (3) but this time using the np.where command. 

11. Download the notebook as .py script and run it from your terminal. 

12. Create a branch in github repository called warm_up_draft   

13. push the notebook with the name CO2 to your new branch on github.